Section_4_Real_Workload_Validation/Experiment13/data/raw/case-C/sustained-ramp/trial_015/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 35.432ms, rate sampling interval: 72ms
  Thread calibration: mean lat.: 35.347ms, rate sampling interval: 72ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.84ms    9.74ms 167.55ms   95.73%
    Req/Sec   201.07     30.06   569.00     91.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.22ms
 75.000%   35.07ms
 90.000%   37.79ms
 99.000%   76.61ms
 99.900%  147.71ms
 99.990%  162.69ms
 99.999%  167.42ms
100.000%  167.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.471     0.000000            2         1.00
      30.063     0.100000         6798         1.11
      30.831     0.200000        13674         1.25
      31.615     0.300000        20419         1.43
      32.431     0.400000        27228         1.67
      33.215     0.500000        34256         2.00
      33.567     0.550000        37610         2.22
      33.919     0.600000        40928         2.50
      34.271     0.650000        44250         2.86
      34.655     0.700000        47655         3.33
      35.071     0.750000        50975         4.00
      35.327     0.775000        52697         4.44
      35.615     0.800000        54460         5.00
      35.935     0.825000        56083         5.71
      36.351     0.850000        57809         6.67
      36.927     0.875000        59505         8.00
      37.311     0.887500        60353         8.89
      37.791     0.900000        61169        10.00
      38.367     0.912500        62016        11.43
      39.071     0.925000        62889        13.33
      39.967     0.937500        63720        16.00
      40.607     0.943750        64127        17.78
      41.823     0.950000        64564        20.00
      44.159     0.956250        64979        22.86
      48.479     0.962500        65401        26.67
      54.047     0.968750        65829        32.00
      56.863     0.971875        66041        35.56
      59.679     0.975000        66251        40.00
      62.815     0.978125        66466        45.71
      65.439     0.981250        66675        53.33
      68.799     0.984375        66892        64.00
      70.079     0.985938        66994        71.11
      72.255     0.987500        67102        80.00
      74.239     0.989062        67207        91.43
      77.951     0.990625        67313       106.67
      85.119     0.992188        67420       128.00
      90.943     0.992969        67472       142.22
      97.279     0.993750        67525       160.00
     104.639     0.994531        67580       182.86
     111.231     0.995313        67632       213.33
     118.015     0.996094        67684       256.00
     121.791     0.996484        67711       284.44
     126.207     0.996875        67737       320.00
     129.983     0.997266        67764       365.71
     133.375     0.997656        67791       426.67
     137.727     0.998047        67817       512.00
     138.879     0.998242        67830       568.89
     141.055     0.998437        67844       640.00
     144.383     0.998633        67858       731.43
     145.663     0.998828        67871       853.33
     147.839     0.999023        67883      1024.00
     149.375     0.999121        67890      1137.78
     149.887     0.999219        67899      1280.00
     150.399     0.999316        67903      1462.86
     152.063     0.999414        67910      1706.67
     153.855     0.999512        67918      2048.00
     154.367     0.999561        67921      2275.56
     155.007     0.999609        67923      2560.00
     156.159     0.999658        67926      2925.71
     157.183     0.999707        67930      3413.33
     158.591     0.999756        67933      4096.00
     158.975     0.999780        67935      4551.11
     159.103     0.999805        67937      5120.00
     159.487     0.999829        67938      5851.43
     162.431     0.999854        67940      6826.67
     162.559     0.999878        67941      8192.00
     162.687     0.999890        67942      9102.22
     162.815     0.999902        67943     10240.00
     163.711     0.999915        67944     11702.86
     164.095     0.999927        67945     13653.33
     164.095     0.999939        67945     16384.00
     164.223     0.999945        67946     18204.44
     164.223     0.999951        67946     20480.00
     167.167     0.999957        67947     23405.71
     167.167     0.999963        67947     27306.67
     167.167     0.999969        67947     32768.00
     167.423     0.999973        67948     36408.89
     167.423     0.999976        67948     40960.00
     167.423     0.999979        67948     46811.43
     167.423     0.999982        67948     54613.33
     167.423     0.999985        67948     65536.00
     167.679     0.999986        67949     72817.78
     167.679     1.000000        67949          inf
#[Mean    =       34.842, StdDeviation   =        9.736]
#[Max     =      167.552, Total count    =        67949]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  71990 requests in 3.00m, 58.56MB read
Requests/sec:    399.94
Transfer/sec:    333.15KB